// const solution = ['1234', '4123', '3412', '2341']; // Масив, в якому кожен елемент - це рядок із порядковими номерами картинок(Вже вирішене завдання)
// const cardsTaskBoard = ['-23-', '41-3', '--12', '23-1']; // Масив, який будемо використовувати для того, щоб відобразити дошку із картинками та пустими клітинками. Замість індексу картинки тут прописуємо дефісю.

// const solution2 = ['34125', '51253', '25431', '43512', '12354'];
// const cardsTaskBoard2 = ['-4125', '5--53', '-5-31', '435-2', '1-3--'];

const levelTasks = {
  level1: {
    task: ['-23-', '41-3', '--12', '23-1'],
    solution: ['1234', '4123', '3412', '2341'],
  },
  level2: {
    task: ['-4125', '5--43', '-5-31', '435-2', '1-3--'],
    solution: ['34125', '51243', '25431', '43512', '12354'],
  },
  level3: {
    task: ['-16-4-', '4--6-1', '-4-256', '6-5-13', '1-2--4', '-6-132'],
    solution: ['216345', '453621', '341256', '625413', '132564', '56413-'],
  },
};
